{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "BertForMaskedLM"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "[SEP]",
    "1": "B-FRAM",
    "2": "B-KNOW",
    "3": "B-LANG",
    "4": "B-PLAT",
    "5": "B-TOOL",
    "6": "I-FRAM",
    "7": "I-KNOW",
    "8": "I-LANG",
    "9": "I-PLAT",
    "10": "I-TOOL",
    "11": "O",
    "12": "[CLS]"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "[SEP]": 0,
    "B-FRAM": 1,
    "I-TOOL": 10,
    "O": 11,
    "[CLS]": 12,
    "B-KNOW": 2,
    "B-LANG": 3,
    "B-PLAT": 4,
    "B-TOOL": 5,
    "I-FRAM": 6,
    "I-KNOW": 7,
    "I-LANG": 8,
    "I-PLAT": 9
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "transformers_version": "4.16.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
